#define _CRT_SECURE_NO_WARNINGS
#include<stdio.h>
//写一个宏交换一个数的二进制的奇偶位
#define Exchange(num) ((num & 0xaaaaaaaa) >> 1) + ((num & 0x55555555) << 1)
//00000000000000000000000000001010
//10101010101010101010101010101010，它是0xaaaaaaaa
//这两个数&之后，得到二进制的偶数位，00000000000000000000000000001010
//右移之后为，00000000000000000000000000000101

//00000000000000000000000000001010
//01010101010101010101010101010101,它是0x55555555
//这两个数&之后，得到二进制的偶数位，00000000000000000000000000000000
//左移之后为，00000000000000000000000000000000

int main()
{
	int num = 10;
	//一个数的二进制的偶数位向右移1位
	//一个数的二进制的奇数位向左移1位
	int ret = Exchange(num);
	printf("%d", ret);
	return 0;
}
//  <<左移操作符：左边丢弃，右边补0
//  >>右移操作符：一般为算数右移
//	(1)算数右移：右边丢弃，左边补符号位，
//	(2)逻辑右移：右边丢弃，左边补0
