//#define _CRT_SECURE_NO_WARNINGS
//#include<stdio.h>
////写一个宏，可以将一个整数的二进制位的奇数位和偶数位交换
//#define Exchange(num) ((num & 0xaaaaaaaa) >> 1) + ((num & 0x55555555) << 1)
//int main()
//{
//	int num = 10;
//	//这个数的二进制的所有偶数位向右移一位
//	//这个数的二进制的所有奇数位向左移一位
//	int ret = Exchange(num);
//	printf("%d", ret);
//	return 0;
//}
////一个数 & 0xaaaaaaaa得到偶数位
////11111111111111111111111111111111
////10101010101010101010101010101010
//
////一个数 & 0x55555555得到奇数位
////11111111111111111111111111111111
////01010101010101010101010101010101